#include<iostream>

int main() {
	//Създаваме число и го въвеждаме от стандартния вход.
	int number = 0;
	std::cin >> number;

	//Докато това число не стане нула вземаме последната му цифра, изкарваме я на стандартния изход
	//и го делим на 10:
	while (number != 0) {
		std::cout << number % 10;
		number = number / 10;
	}
}
	/*	Пример с вход 123
		while(123 != 0) {
			std::cout<<(123 % 10); -> печата се 3
			number = number / 10; -> number става 12
			}
			
			=>
		
		while(12 != 0){
			std::cout<<(12%10); -> печата се 2
			number = number / 10; -> number става 1
		}
		
		=>
		
		while(1 != 0){
			std::cout<<(1 % 10); -> печата се 1
			number = number / 10; -> number става 0
		}

		while(0 != 0) -> цикъла приключва. На стандартния изход сме останали с 321, което решава задачата.

		Ако искаме програмата да работи с вход нула можем да добавим допълнителна проверка.
	*/
