#include<iostream>

int main() {
	int number = 0;
	std::cin >> number;

	int count = 0;

	while (number != 0) { //докато числото не стане нула
		++count; //Увеличавай брояча с едно
		number = number / 10; //дели числото на 10, с което намаляваш цифрите му с 1
	}

	std::cout << count;
}
	/*
		Задачата е подобна на тази с извеждането на числото наобратно само, че този път броим цифрите с променлива count.
	*/
