#include<iostream>

int main() {
	//Искаме да изведем всички числа между 100 и 1000, чиято сума е над 10.
	//Минаваме между всички числа от 100 до 1000, намираме сумата им и ако тя е по - голяма или равна на 10 ги изкарваме на стандартния изход
	for (int i = 100; i < 1000; i++) {
		int sum = 0; //променлива в която пазим сумата
		int iClone = i; //Променлива в която пазим числото, понеже ако работим със самото число ще объркаме цикъла. 
		//Вътре в цикъла можем да променяме стойносттите на i, но в случая това ще обърка задачата ни.

		//Тук логиката е същата като задачата със сумата.
		while (iClone != 0) {
			sum = sum + iClone % 10;
			iClone = iClone / 10;
		}
		//Проверка дали сумата е по голяма от 9, и ако е я идвеждаме на стандартния изход.
		if (sum > 9) {
			std::cout << i << std::endl;
		}
	}
}
