#include<iostream>

int main() {
	int number = 0;
	std::cin >> number;

	for (int i = 1; i <= number; i++) {
		for (int j = 0; j < i; j++) {
			std::cout << "*";
		}

		for (int j = 0; j < number - i; j++) {
			std::cout << " ";
		}
		//std::cout << " --At this step I printed " << i << "* symbols. Now I print new line and keep on printing...";
		//std::cout << std::endl;
	}
  //std::cout << "End of cycle!";
}
	
	/*
	В случая нямаме нищо повече от една последователност от звездички и нови редове. На първия ред е една звездичка, на втория 2 ...
	на н-тия н.
	Удобен инструмен в случая ще е цикъла for, с него преминаваме през всички числа от 1 до н.
	След това от нас се иска да изведем на стандартния изход 1,2...н звездички. Забелязваме, че броят на звездичките
	съответства с това на коя стъпка сме.
	Затова започваме втори for цикъл, който за всяко число от нула до (текущата стъпка) принтира точно толкова звездички колкото са ни нужни!

	Махнете коментарите по кода за да видите как се изпълнява стъпка по стъпка. Също така когато имате вложени цикли
	никога не използвайте едно и също име за променлива. Обърнете внимание как външния цикъл има променлива i а вътрешния j.

	*/
