#include <iostream>
using namespace std;

const int SIZE = 5;
int main()
{
  int arr[SIZE] = {9,8,7,6,5}; //arr е променлива от тип const int*
  int* ptr = arr;
  
  cout << arr << endl; // адресът на първата клетка в масива. 
  cout << ptr << endl; // същият адрес
  
  cout << *ptr   <<endl; // Изкарва стойността на клетката, към която сочи указателят. (Тук това е 9)
  cout << ptr[0] <<endl; // Отпечатва елементът на 0 отстъпа вдясно (тук пак това е 9)
  cout << ptr[1] <<endl; // Отпечатва елементът на 1 отстъп вдясно (тук това е 8)
  
  ptr+=2; // "Премества" указателят 2 клетки надясно.
  
  cout << *ptr   <<endl; // Изкарва стойността на клетката, към която сочи указателят. (Тук това е 7)
  cout << ptr[0] <<endl; // Отпечатва елементът на 0 отстъпа вдясно (тук пак това е 7)
  cout << ptr[1] <<endl; // Отпечатва елементът на 1 отстъп вдясно (тук това е 6)
  
  
  
  cout << *ptr <<endl;
}
